ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR128DA48def.inc
; AC_DACREF masks
.equ AC_DACREF_gm = 0xFF                 ; DACREF group mask
.equ AC_DACREF_gp = 0                    ; DACREF group position
.equ AC_DACREF_0_bm = (1<<0)             ; DACREF bit 0 mask
.equ AC_DACREF_0_bp = 0                  ; DACREF bit 0 position
.equ AC_DACREF_1_bm = (1<<1)             ; DACREF bit 1 mask
.equ AC_DACREF_1_bp = 1                  ; DACREF bit 1 position
.equ AC_DACREF_2_bm = (1<<2)             ; DACREF bit 2 mask
.equ AC_DACREF_2_bp = 2                  ; DACREF bit 2 position
.equ AC_DACREF_3_bm = (1<<3)             ; DACREF bit 3 mask
.equ AC_DACREF_3_bp = 3                  ; DACREF bit 3 position
.equ AC_DACREF_4_bm = (1<<4)             ; DACREF bit 4 mask
.equ AC_DACREF_4_bp = 4                  ; DACREF bit 4 position
.equ AC_DACREF_5_bm = (1<<5)             ; DACREF bit 5 mask
.equ AC_DACREF_5_bp = 5                  ; DACREF bit 5 position
.equ AC_DACREF_6_bm = (1<<6)             ; DACREF bit 6 mask
.equ AC_DACREF_6_bp = 6                  ; DACREF bit 6 position
.equ AC_DACREF_7_bm = (1<<7)             ; DACREF bit 7 mask
.equ AC_DACREF_7_bp = 7                  ; DACREF bit 7 position

; AC_INTCTRL masks
.equ AC_CMP_bm = 0x01                    ; Interrupt Enable bit mask
.equ AC_CMP_bp = 0                       ; Interrupt Enable bit position
.equ AC_INTMODE_NORMAL_gm = 0x30         ; Interrupt Mode group mask
.equ AC_INTMODE_NORMAL_gp = 4            ; Interrupt Mode group position
.equ AC_INTMODE_NORMAL_0_bm = (1<<4)     ; Interrupt Mode bit 0 mask
.equ AC_INTMODE_NORMAL_0_bp = 4          ; Interrupt Mode bit 0 position
.equ AC_INTMODE_NORMAL_1_bm = (1<<5)     ; Interrupt Mode bit 1 mask
.equ AC_INTMODE_NORMAL_1_bp = 5          ; Interrupt Mode bit 1 position
.equ AC_INTMODE_WINDOW_gm = 0x30         ; Interrupt Mode group mask
.equ AC_INTMODE_WINDOW_gp = 4            ; Interrupt Mode group position
.equ AC_INTMODE_WINDOW_0_bm = (1<<4)     ; Interrupt Mode bit 0 mask
.equ AC_INTMODE_WINDOW_0_bp = 4          ; Interrupt Mode bit 0 position
.equ AC_INTMODE_WINDOW_1_bm = (1<<5)     ; Interrupt Mode bit 1 mask
.equ AC_INTMODE_WINDOW_1_bp = 5          ; Interrupt Mode bit 1 position

; AC_STATUS masks
.equ AC_CMPIF_bm = 0x01                  ; Analog Comparator Interrupt Flag bit mask
.equ AC_CMPIF_bp = 0                     ; Analog Comparator Interrupt Flag bit position
.equ AC_CMPSTATE_bm = 0x10               ; Analog Comparator State bit mask
.equ AC_CMPSTATE_bp = 4                  ; Analog Comparator State bit position
.equ AC_WINSTATE_gm = 0xC0               ; Analog Comparator Window State group mask
.equ AC_WINSTATE_gp = 6                  ; Analog Comparator Window State group position
.equ AC_WINSTATE_0_bm = (1<<6)           ; Analog Comparator Window State bit 0 mask
.equ AC_WINSTATE_0_bp = 6                ; Analog Comparator Window State bit 0 position
.equ AC_WINSTATE_1_bm = (1<<7)           ; Analog Comparator Window State bit 1 mask
.equ AC_WINSTATE_1_bp = 7                ; Analog Comparator Window State bit 1 position

; Hysteresis Mode select
.equ AC_HYSMODE_NONE_gc = (0x00<<1)      ; No hysteresis
.equ AC_HYSMODE_SMALL_gc = (0x01<<1)     ; Small hysteresis
.equ AC_HYSMODE_MEDIUM_gc = (0x02<<1)    ; Medium hysteresis
.equ AC_HYSMODE_LARGE_gc = (0x03<<1)     ; Large hysteresis

; Power profile select
.equ AC_POWER_PROFILE0_gc = (0x00<<3)    ; Power profile 0, Shortest response time, highest consumption
.equ AC_POWER_PROFILE1_gc = (0x01<<3)    ; Power profile 1
.equ AC_POWER_PROFILE2_gc = (0x02<<3)    ; Power profile 2

; Window selection mode
.equ AC_WINSEL_DISABLED_gc = (0x00<<0)   ; Window function disabled
.equ AC_WINSEL_UPSEL1_gc = (0x01<<0)     ; Select ACn+1 as upper limit in window compare
.equ AC_WINSEL_UPSEL2_gc = (0x02<<0)     ; Select ACn+2 as upper limit in window compare

; Interrupt Mode select
.equ AC_NORMAL_INTMODE_BOTHEDGE_gc = (0x00<<4) ; Positive and negative inputs crosses
.equ AC_NORMAL_INTMODE_NEGEDGE_gc = (0x02<<4) ; Positive input goes below negative input
.equ AC_NORMAL_INTMODE_POSEDGE_gc = (0x03<<4) ; Positive input goes above negative input

; Interrupt Mode select
.equ AC_WINDOW_INTMODE_ABOVE_gc = (0x00<<4) ; Window interrupt when input above both references
.equ AC_WINDOW_INTMODE_INSIDE_gc = (0x01<<4) ; Window interrupt when input betweeen references
.equ AC_WINDOW_INTMODE_BELOW_gc = (0x02<<4) ; Window interrupt when input below both references
.equ AC_WINDOW_INTMODE_OUTSIDE_gc = (0x03<<4) ; Window interrupt when input outside reference

; AC Output Initial Value select
.equ AC_INITVAL_LOW_gc = (0x00<<6)       ; Output initialized to 0
.equ AC_INITVAL_HIGH_gc = (0x01<<6)      ; Output initialized to 1

; Negative Input MUX Selection
.equ AC_MUXNEG_AINN0_gc = (0x00<<0)      ; Negative Pin 0
.equ AC_MUXNEG_AINN1_gc = (0x01<<0)      ; Negative Pin 1
.equ AC_MUXNEG_AINN2_gc = (0x02<<0)      ; Negative Pin 2
.equ AC_MUXNEG_DACREF_gc = (0x03<<0)     ; DAC Reference

; Positive Input MUX Selection
.equ AC_MUXPOS_AINP0_gc = (0x00<<3)      ; Positive Pin 0
.equ AC_MUXPOS_AINP1_gc = (0x01<<3)      ; Positive Pin 1
.equ AC_MUXPOS_AINP2_gc = (0x02<<3)      ; Positive Pin 2
.equ AC_MUXPOS_AINP3_gc = (0x03<<3)      ; Positive Pin 3

; Analog Comparator Window State select
.equ AC_WINSTATE_ABOVE_gc = (0x00<<6)    ; Above window
.equ AC_WINSTATE_INSIDE_gc = (0x01<<6)   ; Inside window
.equ AC_WINSTATE_BELOW_gc = (0x02<<6)    ; Below window


;*************************************************************************
;** ADC - Analog to Digital Converter
;*************************************************************************

; ADC_CTRLA masks
.equ ADC_ENABLE_bm = 0x01                ; ADC Enable bit mask
.equ ADC_ENABLE_bp = 0                   ; ADC Enable bit position
.equ ADC_FREERUN_bm = 0x02               ; Free running mode bit mask
.equ ADC_FREERUN_bp = 1                  ; Free running mode bit position
.equ ADC_RESSEL_gm = 0x0C                ; Resolution selection group mask
.equ ADC_RESSEL_gp = 2                   ; Resolution selection group position
.equ ADC_RESSEL_0_bm = (1<<2)            ; Resolution selection bit 0 mask
.equ ADC_RESSEL_0_bp = 2                 ; Resolution selection bit 0 position
.equ ADC_RESSEL_1_bm = (1<<3)            ; Resolution selection bit 1 mask
.equ ADC_RESSEL_1_bp = 3                 ; Resolution selection bit 1 position
.equ ADC_LEFTADJ_bm = 0x10               ; Left adjust result bit mask
.equ ADC_LEFTADJ_bp = 4                  ; Left adjust result bit position
.equ ADC_CONVMODE_bm = 0x20              ; Conversion mode bit mask
.equ ADC_CONVMODE_bp = 5                 ; Conversion mode bit position
.equ ADC_RUNSTBY_bm = 0x80               ; Run standby mode bit mask
.equ ADC_RUNSTBY_bp = 7                  ; Run standby mode bit position

; ADC_CTRLB masks
.equ ADC_SAMPNUM_gm = 0x07               ; Accumulation Samples group mask
.equ ADC_SAMPNUM_gp = 0                  ; Accumulation Samples group position
.equ ADC_SAMPNUM_0_bm = (1<<0)           ; Accumulation Samples bit 0 mask
.equ ADC_SAMPNUM_0_bp = 0                ; Accumulation Samples bit 0 position
.equ ADC_SAMPNUM_1_bm = (1<<1)           ; Accumulation Samples bit 1 mask
.equ ADC_SAMPNUM_1_bp = 1                ; Accumulation Samples bit 1 position
.equ ADC_SAMPNUM_2_bm = (1<<2)           ; Accumulation Samples bit 2 mask
.equ ADC_SAMPNUM_2_bp = 2                ; Accumulation Samples bit 2 position

; ADC_CTRLC masks
.equ ADC_PRESC_gm = 0x0F                 ; Clock Pre-scaler group mask
.equ ADC_PRESC_gp = 0                    ; Clock Pre-scaler group position
.equ ADC_PRESC_0_bm = (1<<0)             ; Clock Pre-scaler bit 0 mask
.equ ADC_PRESC_0_bp = 0                  ; Clock Pre-scaler bit 0 position
.equ ADC_PRESC_1_bm = (1<<1)             ; Clock Pre-scaler bit 1 mask
.equ ADC_PRESC_1_bp = 1                  ; Clock Pre-scaler bit 1 position
.equ ADC_PRESC_2_bm = (1<<2)             ; Clock Pre-scaler bit 2 mask
.equ ADC_PRESC_2_bp = 2                  ; Clock Pre-scaler bit 2 position
.equ ADC_PRESC_3_bm = (1<<3)             ; Clock Pre-scaler bit 3 mask
.equ ADC_PRESC_3_bp = 3                  ; Clock Pre-scaler bit 3 position

; ADC_CTRLD masks
.equ ADC_SAMPDLY_gm = 0x0F               ; Sampling Delay Selection group mask
.equ ADC_SAMPDLY_gp = 0                  ; Sampling Delay Selection group position
.equ ADC_SAMPDLY_0_bm = (1<<0)           ; Sampling Delay Selection bit 0 mask
.equ ADC_SAMPDLY_0_bp = 0                ; Sampling Delay Selection bit 0 position
.equ ADC_SAMPDLY_1_bm = (1<<1)           ; Sampling Delay Selection bit 1 mask
.equ ADC_SAMPDLY_1_bp = 1                ; Sampling Delay Selection bit 1 position
.equ ADC_SAMPDLY_2_bm = (1<<2)           ; Sampling Delay Selection bit 2 mask
.equ ADC_SAMPDLY_2_bp = 2                ; Sampling Delay Selection bit 2 position
.equ ADC_SAMPDLY_3_bm = (1<<3)           ; Sampling Delay Selection bit 3 mask
.equ ADC_SAMPDLY_3_bp = 3                ; Sampling Delay Selection bit 3 position
.equ ADC_INITDLY_gm = 0xE0               ; Initial Delay Selection group mask
.equ ADC_INITDLY_gp = 5                  ; Initial Delay Selection group position
.equ ADC_INITDLY_0_bm = (1<<5)           ; Initial Delay Selection bit 0 mask
.equ ADC_INITDLY_0_bp = 5                ; Initial Delay Selection bit 0 position
.equ ADC_INITDLY_1_bm = (1<<6)           ; Initial Delay Selection bit 1 mask
.equ ADC_INITDLY_1_bp = 6                ; Initial Delay Selection bit 1 position
.equ ADC_INITDLY_2_bm = (1<<7)           ; Initial Delay Selection bit 2 mask
.equ ADC_INITDLY_2_bp = 7                ; Initial Delay Selection bit 2 position

; ADC_CTRLE masks
.equ ADC_WINCM_gm = 0x07                 ; Window Comparator Mode group mask
.equ ADC_WINCM_gp = 0                    ; Window Comparator Mode group position
.equ ADC_WINCM_0_bm = (1<<0)             ; Window Comparator Mode bit 0 mask
.equ ADC_WINCM_0_bp = 0                  ; Window Comparator Mode bit 0 position
.equ ADC_WINCM_1_bm = (1<<1)             ; Window Comparator Mode bit 1 mask
.equ ADC_WINCM_1_bp = 1                  ; Window Comparator Mode bit 1 position
.equ ADC_WINCM_2_bm = (1<<2)             ; Window Comparator Mode bit 2 mask
.equ ADC_WINCM_2_bp = 2                  ; Window Comparator Mode bit 2 position

